In [4]:
import pandas as pd
import numpy as np

1. ¿Qué diferencia hay entre una Serie y un DataFrame?
La Serie  es unidimensional y el DataFrame no (2dimensiones).

2. Momento de trabajar con Series. Contesta a las siguientes preguntas:
- Crea dos listas:
    - Una que se llame "valores" que tenga 7 números aleatorios.
    - Otra que se llame "indices" que tenga 7 strings que se llamen como los días de la semana.
- A partir de estas dos listas crea una Serie donde la variable "valores" sean los valores de la Serie y la variable indices sean los índices de la Serie.

In [5]:
lista1 = np.random.randint(0,10,(7))
valores = pd.Series(lista1)
lista_dias_semana = ["Lunes", "Martes", "Miercoles", "Jueves", "Viernes", "Sabado", "Domingo"]
indices = pd.Series(lista_dias_semana)
print(valores)
print("------------")
print(indices)

0    1
1    7
2    4
3    1
4    0
5    1
6    3
dtype: int64
------------
0        Lunes
1       Martes
2    Miercoles
3       Jueves
4      Viernes
5       Sabado
6      Domingo
dtype: object

In [6]:
serie_valores = pd.Series(lista1, index=lista_dias_semana)
serie_valores

Lunes        1
Martes       7
Miercoles    4
Jueves       1
Viernes      0
Sabado       1
Domingo      3
dtype: int64

- A partir de las dos listas anteriores crea un diccionario usando un bucle for. Para hacer esto tenemos el método zip que nos permite iterar por dos listas a la vez. Más informción sobre este método aquí.

In [7]:
diccionario = {}
for k,v in zip(lista_dias_semana,lista1):
    diccionario[k]=v
print(diccionario)

{'Lunes': 1, 'Martes': 7, 'Miercoles': 4, 'Jueves': 1, 'Viernes': 0, 'Sabado': 1, 'Domingo': 3}

- Crea una Serie con el diccionario creado en el punto anterior.

In [8]:
serie_diccionario = pd.Series(diccionario)
serie_diccionario

Lunes        1
Martes       7
Miercoles    4
Jueves       1
Viernes      0
Sabado       1
Domingo      3
dtype: int64

- ¿Qué forma tiene esta última Serie?

In [9]:
np.shape(serie_diccionario)

(7,)

- ¿Qué tipo de datos tiene?

In [10]:
np.dtype(serie_diccionario)

dtype('int64')

- ¿Qué tamaño tiene?

In [11]:
np.size(serie_diccionario)

7

- ¿Cuáles son los índices de la Serie?

In [12]:
print(serie_diccionario.index)

Index(['Lunes', 'Martes', 'Miercoles', 'Jueves', 'Viernes', 'Sabado',
       'Domingo'],
      dtype='object')

- ¿Y los values?

In [13]:
print(serie_diccionario.values)

[1 7 4 1 0 1 3]

- Extrae el valor para el índice "lunes"
- Extrae el valor para el índice "lunes", "martes" y "miércoles".
- Extrae el valor para el índice "lunes" y "domingo".

In [14]:
print(serie_diccionario["Lunes"])
print("--------------")
print(serie_diccionario[0:3])
print("--------------")
print("El Lunes:", serie_diccionario["Lunes"], "y el Domingo", serie_diccionario["Domingo"])

1
--------------
Lunes        1
Martes       7
Miercoles    4
dtype: int64
--------------
El Lunes: 1 y el Domingo 3

3. Es el turno de los DataFrames
- Crea un array de dos dimensiones con 4 filas y 3 columnas.

In [15]:
array_2d = np.random.randint(1,50,(4,3))
array_2d

array([[31, 18,  9],
       [ 7, 31, 46],
       [ 9, 12, 14],
       [32, 30, 45]])

Convierte el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".

In [16]:
df_2d_paises = pd.DataFrame(array_2d, columns=["España", "Francia", "Italia"])
df_2d_paises

   España  Francia  Italia
0      31       18       9
1       7       31      46
2       9       12      14
3      32       30      45

- Descarga el archivo "medallas" y carga el DataFrame.

In [17]:
df_medallas = pd.read_csv("data/medallas.csv", index_col=0)
df_medallas

               País   Oro  Plata  Bronce
1             China  1473    994     720
2             Japón  1032   1037     985
3     Corea del Sur   745    663     827
4              Irán   179    181     197
5        Kazajistán   155    158     224
6             India   154    202     315
7         Tailandia   132    175     278
8         Indonesia   112    131     240
9      China Taipéi    99    144     276
10  Corea del Norte    91    120     235

- Usando el loc extrae todas las columnas de la fila de Tailandia.

In [18]:
df_medallas.loc[7,:]

País      Tailandia
Oro             132
Plata           175
Bronce          278
Name: 7, dtype: object

- Usando el loc extrae todas las columnas de China e Irán.

In [19]:
df_medallas.loc[1:4:3,:]

    País   Oro  Plata  Bronce
1  China  1473    994     720
4   Irán   179    181     197

- Usando el loc extrae solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.

In [20]:
df_medallas.loc[1:4:3,"Oro":]

    Oro  Plata  Bronce
1  1473    994     720
4   179    181     197

- Usando el iloc extrae la información de la India. Devolved todas las columnas.

In [21]:
df_medallas
#Mirar como buscar el indice con get_loc

               País   Oro  Plata  Bronce
1             China  1473    994     720
2             Japón  1032   1037     985
3     Corea del Sur   745    663     827
4              Irán   179    181     197
5        Kazajistán   155    158     224
6             India   154    202     315
7         Tailandia   132    175     278
8         Indonesia   112    131     240
9      China Taipéi    99    144     276
10  Corea del Norte    91    120     235

In [22]:
df_medallas.iloc[5,:]

País      India
Oro         154
Plata       202
Bronce      315
Name: 6, dtype: object

- Usando el iloc extrae todas las columnas de los paises que estén en posición impar. La primera que nos tendría que salir es Japón y la última Corea del Norte.

In [23]:
df_medallas.iloc[1::2,:]

               País   Oro  Plata  Bronce
2             Japón  1032   1037     985
4              Irán   179    181     197
6             India   154    202     315
8         Indonesia   112    131     240
10  Corea del Norte    91    120     235

- Utilizando el código del ejercicio anterior, selecciona unicamente las columnas "Oro", "Plata" y "Bronce".

In [24]:
df_medallas.iloc[1::2,1:]

     Oro  Plata  Bronce
2   1032   1037     985
4    179    181     197
6    154    202     315
8    112    131     240
10    91    120     235

Contesta a las siguientes preguntas:
- ¿Qué país consiguió más de 200 medallas de oro?
        - 
- ¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?

In [27]:
df_medallas

               País   Oro  Plata  Bronce
1             China  1473    994     720
2             Japón  1032   1037     985
3     Corea del Sur   745    663     827
4              Irán   179    181     197
5        Kazajistán   155    158     224
6             India   154    202     315
7         Tailandia   132    175     278
8         Indonesia   112    131     240
9      China Taipéi    99    144     276
10  Corea del Norte    91    120     235

In [26]:
df_medallas.loc[df_medallas["Oro"]>200, "País"]

1            China
2            Japón
3    Corea del Sur
Name: País, dtype: object

In [33]:
condicion1=df_medallas["Oro"]>200
condicion2=df_medallas["Plata"]>1000
df_medallas.loc[(condicion1 & condicion2), "País"]

2    Japón
Name: País, dtype: object

In [37]:
#Se puede resolver también de esta forma
df_medallas.loc[((df_medallas["Oro"]>200) & (df_medallas["Plata"]>1000)), "País"]

2    Japón
Name: País, dtype: object

- ¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?
- Crea una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.

In [38]:
df_medallas.loc[((df_medallas.Oro>200) & (df_medallas.Bronce>700)), "País"]

1            China
2            Japón
3    Corea del Sur
Name: País, dtype: object

In [39]:
df_medallas.loc[:, "Oro":]

     Oro  Plata  Bronce
1   1473    994     720
2   1032   1037     985
3    745    663     827
4    179    181     197
5    155    158     224
6    154    202     315
7    132    175     278
8    112    131     240
9     99    144     276
10    91    120     235

In [41]:
df_medallas["total"] = (df_medallas["Oro"]+df_medallas["Plata"]+df_medallas["Bronce"])
df_medallas

               País   Oro  Plata  Bronce  total
1             China  1473    994     720   3187
2             Japón  1032   1037     985   3054
3     Corea del Sur   745    663     827   2235
4              Irán   179    181     197    557
5        Kazajistán   155    158     224    537
6             India   154    202     315    671
7         Tailandia   132    175     278    585
8         Indonesia   112    131     240    483
9      China Taipéi    99    144     276    519
10  Corea del Norte    91    120     235    446